# 1. Создать произвольный список
# 2. Добавить новый элемент типа str в конец списка
# 3. Добавить новый элемент типа int на место с индексом
# 4. Добавить новый элемент типа list в конец списка
# 5. Получить элемент по индексу
# 6. Удалить элемент
# 7. Найти число повторений элемента списка


# создать две числовые переменные. Создать список. В созданный список добавить значения:
# суммы этих двух переменных, произведения, деления. 
# После чего преобразовать обе числовые переменные в строки, и добавить в конец списка 